#בשם ד נעשה ונצליח
#ייבוא ספריה
import datetime

#מילון של שאלות אישיות
question={
    1:" מה הדבר שהכי מלהיב אותך כרגע בחיים?",
    2:" איך את מתארת את הסגנון שלך?",
    3:" מה החלום הכי גדול שלך?",
    4:"איזו תכונה את הכי מעריכה באדם אחר?",
    5:"מה הדבר הכי חשוב לך בקשר עם חברים?",
    6:" איך את מתמודדת עם כישלון?",
    7:" מה הדבר שהכי מטריד אותך לגבי העתיד?",
    8:" איזו תכונה את רוצה לפתח בעצמך?",
    9:" מהי ההשראה הכי גדולה שלך?",
    10:" איך את לומדת הכי טוב?",
}

#מילון של 4 אפשרויות לבחירת תשובה לכל שאלת אישיות
answers={
    1: {'a':"להצליח בקריירה שלי ולהשיג עצמאות כלכלית",'b':"לטייל בעולם ולגלות תרבויות חדשות",'c':"לבנות מערכות יחסים משמעותיות עם אנשים שאני אוהבת",'d':"לפתח את הכישרונות והיצירתיות שלי"},
    2:{'a':"אני אוהבת להתלבש אופנתי ובולט.",'b':"אני מעדיפה נוחות ופרקטיות בבגדים.",'c':"הסגנון שלי משקף את מצב הרוח שלי ומשתנה בהתאם.",'d':"אני לא משקיעה הרבה מחשבה על בגדים."},
    3:{'a':"להקים משפחה מאושרת.",'b':"להצליח בתחום המקצועי שלי.",'c':"לטייל בעולם ולגלות מקומות חדשים.",'d':"לעשות שינוי בעולם ולהשפיע על אנשים אחרים."},
    4:{'a':"כנות ואמינות.",'b':"חוש הומור.",'c':"חמלה ונדיבות.",'d':"אינטליגנציה ויצירתיות."},
    5:{'a':"תמיכה הדדית והקשבה.",'b':"חוויות משותפות והנאה.",'c':"כבוד הדדי והבנה.",'d':"עצמאות אישית וחופש."},
    6:{'a':"אני מתעצבנת ומאשימה את עצמי.",'b':"אני לומדת מהטעויות וממשיכה הלאה.",'c':"אני בוחרת להתעלם מהבעיה ולהמשיך הלאה.",'d':"אני מבקשת עזרה מחברים או מבני משפחה."},
    7:{'a':"אי הוודאות והבלתי נודע.",'b':"כישלון והיעדר הצלחה.",'c':"בדידות ובידוד חברתי.",'d':"שינויים גדולים בחיים."},
    8:{'a':"סבלנות ואיפוק.",'b':"ביטחון עצמי ואסרטיביות.",'c':"יצירתיות וחשיבה מחוץ לקופסה.",'d':"יכולת להתמודד עם לחץ."},
    9:{'a':"אנשים שהצליחו להתגבר על קשיים.",'b':" אנשים יצירתיים וחרוצים.",'c':"אנשים שמקדישים את חייהם לעזרה לאחרים.",'d':"אנשים חזקים ועצמאיים."},
    10:{'a':"קריאה שקטה ומעמיקה של החומר.",'b':"פתרון תרגילים ושאלות מעשיות",'c':"דיון עם חברים או מורים על החומר הנלמד.",'d':"יצירת סיכומים ושרטוט תרשימים."},
}

#חלוקת סוגי האשיות ל4 סוגים עיקריים
# i-independent-עצמאי
# c-creative-יצירתי
# p-practical-מעשי
# s-sociable-חברותי

#הוספת נקודות לפי 4 סוגי אשיות
points={'i':0,'c':0,'p':0,'s':0}

#לכל תשובה שהמשתמש בחר נוסיף נקודה לאשיות המתאימה לתשובה
#המפתח יהיה מספר השאלה וערך יהיה מילון שיינתב לכל תשובה את האשיות המתאימה
link={
    1:{'a':['p'],'b':['s','c'],'c':['s'],'d':['c']},
    2:{'a':['s'],'b':['p'],'c':['c'],'d':['i']},
    3:{'a':['s','p'],'b':['p'],'c':['s','c'],'d':['s','c','p']},
    4:{'a':['p','i'],'b':['s'],'c':['s','i'],'d':['c']},
    5:{'a':['s','i'],'b':['s'],'c':['s','i','p'],'d':['i']},
    6:{'a':['i'],'b':['p','c'],'c':['i'],'d':['s']},
    7:{'a':['i'],'b':['p'],'c':['i'],'d':['s','c']},
    8:{'a':['p'],'b':['s'],'c':['c'],'d':['p']},
    9:{'a':['p'],'b':['c'],'c':['s','p'],'d':['p','i']},
    10:{'a':['i','p'],'b':['p'],'c':['s','c'],'d':['c','p']},
}

#אתחול הנקודות ב 0
def initializationPoints(myPoints):
    for k in myPoints.keys():
        myPoints[k]=0

#עדכון הנקודות בכל איטרציה
def updatePoints(list1,myPoints):
    for k in list1:
        myPoints[k]+=1

#יחזיר את האישיות שיש לה הכי הרבה נקודות
def maxPointer(myPoints):
    return max(myPoints,key=myPoints.get)

#פונקציה המחזירה את אישיות המשתמש
def personality(myPoints):
    userPersonality= maxPointer(myPoints)
    match userPersonality:
        case 'i':  # i-independent-עצמאי
            return "את עצמאית ואוהבת שקט.\n את מעדיפה לבלות זמן לבד או בקבוצות קטנות ומאפשרת להעמיק מחשבות ורגשות.\n את נהנית מפעילויות סולו כמו קריאה, כתיבה או התבוננות בטבע."
        case 'c':  # c-creative-יצירתי
            return "את יצירתית וחושבת מחוץ לקופסה.\n את אוהבת אמנות, מוזיקה, ופעילויות שמאפשרות להביע את עצמך באופן יצירתי.\n את נהנית לחקור רעיונות חדשים ולפתור בעיות בצורה מקורית."
        case'p':   # p-practical-מעשי
            return "את ממוקדת מטרה, יעילה ואוהבת סדר.\n את נהנית לתכנן, לארגן ולסיים משימות.\n את מעדיפה גישה מעשית לפתרון בעיות."
        case's':   # s-sociable-חברותי
            return "את חברותית ואוהבת פעילויות חברתיות.\n את נהנית להיות מוקפת אנשים ומתחברת בקלות לאחרים.\n את אוהבת להיות במרכז העניינים ולתרום לאווירה החיובית."

#קובץ משתמשים שיכיל תאריך שם משתמש ואשיותו
f=open(file='user.txt',mode='a',encoding='utf-8')

#התחלת התוכנית
print("מבחן האישיות כבר מתחיל... מוכנה?")
name=input("הכניסי את שמך")
f.write("\n \n תאריך: "+str(datetime.date.today())+" האשיות של: "+name)
print("מבחן זה נועד לגלות את הצדדים הייחודיים באישיות שלך.")
print("אין נכון ולא נכון, פשוט עני על השאלות כפי שאת מרגישה.")
print("בכל שאלה עני a/b/c/d בהתאמה לסדר התשובות המוצגות לך.בהצלחה!")

#זמון הפונקציה לאתחול הנקודות ב 0
initializationPoints(points)

#יכיל מספרים מ1 עד 11
listRange=[x for x in range(1,11)]

#לולאה שתעבור על השאלות, התשובות ותוסיף את הנקודות המתאימות
for i in listRange:
    #שאלה:
    print("שאלה מספר:"+str(i)+"\n"+question[i])
    #תשובות
    for value in answers[i].values():
        print(value)

    #קבלת תשובה מהמשתמש
    answer = input()

    #במקרה שהמשתמש הכניס קלט לא נכון תקפוץ לו הודעת שגיאה
    try:
        updatePoints(link[i][answer], points)
    except:
        answer=input("הקלט לא תקין! {},בחרי שוב בתשובה המתאימה לך.".format(name))

    #לולאה שתעבוד כל עוד הקלט שגוי
    while(answer!="a" or answer!="b" or answer!="c" or answer!="d"):
        try:
            updatePoints(link[i][answer],points)
            break;
        except:
            answer=input("הקלט לא תקין! {},בחרי שוב בתשובה המתאימה לך.".format(name))

#כתיבת האשיות לקובץ וסגירתו
f.write("\n"+personality(points))
f.close()

#הדפסת האשיות של המשמש
print("{}:".format(name))
print(personality(points))





